---
kind: method
id: M:Autodesk.Revit.DB.PrimarySizeCriterion.None
source: html/ea9e757e-e40d-652f-5b4e-d6dd49fef8da.htm
---
# Autodesk.Revit.DB.PrimarySizeCriterion.None Method

Creates a criterion with a range of no sizes.

## Syntax (C#)
```csharp
public static PrimarySizeCriterion None()
```

## Returns
The new criterion.

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.